Revit 2027 API
BuiltInFailures.PathOfTravelFailures.UpdateFailureSingle Property
 Path of Travel failed to update.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UpdateFailureSingle { get; }
Public Shared ReadOnly Property UpdateFailureSingle As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UpdateFailureSingle {
	FailureDefinitionId^ get ();
}
static member UpdateFailureSingle : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PathOfTravelFailures Class
Autodesk.Revit.DB Namespace